// -----------------------задание 5-----------------------------

// Дан произвольный массив. Необходимо вывести количество элементов массива, затем перебрать 
// его и вывести в консоль каждый элемент массива.


// -------------вариант - 1----------------

let array = [1, 2, 3, 4, 5];
console.log(array.length);
for (let i = 0; i<=(array.length); i++) {
console.log(i);
}


//-------------вариант - 2----------------


let array = [1, 2, 3, 4, 5];
console.log(array.length);
let i = 0;
while (i<=(array.length)) {
console.log(i);
i++;
}